# Homework: Joins & Tidy Data

## Question 1
Read in all 4 credit card transaction datasets and clean up the column names.

- CardBase.csv
- CustomerBase.csv
- FraudBase.csv
- TransactionBase.csv

In [1]:
import pandas as pd
# conda install pyjanitor -c conda-forge
from janitor import clean_names

In [2]:
card_base = pd.read_csv('data/CardBase.csv')
customer_base = pd.read_csv('data/CustomerBase.csv')
fraud_base = pd.read_csv('data/FraudBase.csv')
transaction_base = pd.read_csv('data/TransactionBase.csv')

In [3]:
card_base = clean_names(card_base)
card_base.head()

           card_number card_family  credit_limit  cust_id
0  8638-5407-3631-8196     Premium        530000  CC67088
1  7106-4239-7093-1515        Gold         18000  CC12076
2  6492-5655-8241-3530     Premium        596000  CC97173
3  2868-5606-5152-5706        Gold         27000  CC55858
4  1438-6906-2509-8219    Platinum        142000  CC90518

In [4]:
customer_base = clean_names(customer_base)
customer_base.head()

   cust_id  age customer_segment customer_vintage_group
0  CC25034   35          Diamond                    VG1
1  CC59625   22          Diamond                    VG1
2  CC69314   33          Diamond                    VG1
3  CC67036   46          Diamond                    VG1
4  CC25597   44          Diamond                    VG1

In [5]:
fraud_base = clean_names(fraud_base)
fraud_base.head()

  transaction_id  fraud_flag
0   CTID50558449           1
1   CTID55936882           1
2   CTID63762180           1
3   CTID76723439           1
4   CTID21246201           1

In [6]:
transaction_base = clean_names(transaction_base)
transaction_base.head()

,transaction_id,transaction_date,credit_card_id,transaction_value,transaction_segment
0,CTID28830551,24-Apr-16,1629-9566-3285-2123,23649,SEG25
1,CTID45504917,11-Feb-16,3697-6001-4909-5350,26726,SEG16
2,CTID47312290,1-Nov-16,5864-4475-3659-1440,22012,SEG14
3,CTID25637718,28-Jan-16,5991-4421-8476-3804,37637,SEG17
4,CTID66743960,17-Mar-16,1893-8853-9900-8478,5113,SEG14

## Question 2
Join the data containing card details and customer details by customer id, so that all records of card details and any matching records in customer details are kept.

In [7]:
card_and_customer = card_base.merge(
    customer_base, 
    how='left', 
    on='cust_id')
card_base
card_and_customer

,card_number,card_family,credit_limit,cust_id,age,customer_segment,customer_vintage_group
0,8638-5407-3631-8196,Premium,530000,CC67088,27,Diamond,VG1
1,7106-4239-7093-1515,Gold,18000,CC12076,48,Gold,VG3
2,6492-5655-8241-3530,Premium,596000,CC97173,22,Diamond,VG1
3,2868-5606-5152-5706,Gold,27000,CC55858,30,Diamond,VG1
4,1438-6906-2509-8219,Platinum,142000,CC90518,50,Platinum,VG2
...,...,...,...,...,...,...,...
495,4708-4407-9601-6022,Premium,691000,CC64993,34,Diamond,VG1
496,6042-2856-7280-2925,Gold,33000,CC26787,46,Platinum,VG2
497,8706-3809-5167-3899,Premium,144000,CC32532,28,Platinum,VG2
498,9540-8558-5897-5046,Premium,830000,CC90246,35,Gold,VG3
499,5587-7265-8118-7718,Gold,24000,CC37803,21,Diamond,VG1

## Question 3
Join the data containing fraud details with transaction details so all rows of both tables are kept. What does the resulting row number tell you?

In [8]:
fraud_and_transaction = fraud_base.merge(
    transaction_base, 
    how='outer', 
    on='transaction_id')
fraud_and_transaction

fraud_base.shape # 109, 2
transaction_base.shape # 10000, 5
fraud_and_transaction.shape # 10000, 6
# same number of rows as transactions

(10000, 6)

# Question 4
[Harder] Perform a filtering join between cards and transactions so that only the card details for cards that have made at least one transaction are preserved.

Hint: semi is not an allowed option for how in .merge(). You'll need to think about the process of a semi join and then perform each step.

In [9]:
# ? couldn't find a good explanation of the 'process'

# Tidy Data

## Question 5
Read in hat_observations and split observation into two columns, hat_colour and hat_type.

Hint: Look up the pandas documentation for .str.split()

In [10]:
hat_observations = pd.read_csv('data/hat_observations.csv')
hat_observations.head()

   day  month  year      observation  observation_count
0   25     10  2019      black,beret                  7
1   11      9  2019     blue,top hat                 10
2    4     12  2018  green,santa hat                  9
3   18      6  2018      white,beret                  9
4   26      9  2018  black,santa hat                  1

In [15]:
hat_observations[['hat_colour', 'hat_type']] = hat_observations['observation'].str.split(',', expand=True)
hat_observations.head()

   day  month  year      observation  observation_count hat_colour   hat_type
0   25     10  2019      black,beret                  7      black      beret
1   11      9  2019     blue,top hat                 10       blue    top hat
2    4     12  2018  green,santa hat                  9      green  santa hat
3   18      6  2018      white,beret                  9      white      beret
4   26      9  2018  black,santa hat                  1      black  santa hat

## Question 6
Unite day, month, and year columns into a column called date using a suitable separator. Then find the date where the most berets were observed.

Hints:

you can use the .agg() function to combine columns
you may need to convert the data types of the columns you wish to combine

In [30]:
hat_observations['date'] = '-'.join((hat_observations['year'], hat_observations['month'], hat_observations['day'])) 
hat_observations.head()

# Can't figure out syntax of strings fo join function
# str(hat_observations['year']) + '-' didn't work either

TypeError: sequence item 0: expected str instance, Series found